<template>
  <n-space>
    <n-button>Default</n-button>
    <n-button type="tertiary">Tertiary</n-button>
    <n-button type="primary">Primary</n-button>
    <n-button type="info">Info</n-button>
    <n-button type="success">Success</n-button>
    <n-button type="warning">Warning</n-button>
    <n-button type="error" @click="settingStore.toggleTheme">Error</n-button>
  </n-space>
  我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧我们在田野上面找猪
  <br />
  想象中已找到了三只
  <br />
  小鸟在白云上面追逐
  <br />
  它们在树底下跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  想象中我们是如此的疯狂
  <br />
  我们在城市里面找猪
  <br />
  想象中已找到了几百万只
  <br />
  小鸟在公园里面唱歌
  <br />
  它们独自在想象里跳舞
  <br />
  啦啦啦啦啦啦啦啦咧
  <br />
  啦啦啦啦咧
  <br />
  我们在想象中度过了许多年
  <br />
  许多年之后我们又开始想象
  <br />
  啦啦啦啦啦啦啦啦咧
</template>

<script setup lang="ts" name="Dashboard">
  const settingStore = useSettingStore()
  const changeTheme = () => settingStore.toggleTheme()
</script>

<style scoped></style>
